   ### Deployment Results ✅

   **JamesHaughey** successfully **noop** deployed branch `demo/pull-request` to **production**
 
   <details><summary>Show Results</summary>
 
   ```terraform
Acquiring state lock. This may take a few moments...
module.tfstate_backend.data.aws_region.current: Reading...
module.tfstate_backend.module.log_storage.data.aws_partition.current: Reading...
module.tfstate_backend.aws_dynamodb_table.with_server_side_encryption[0]: Refreshing state... [id=elbokade-tf-state-backend-lock]
module.tfstate_backend.module.log_storage.data.aws_caller_identity.current: Reading...
module.tfstate_backend.data.aws_region.current: Read complete after 0s [id=eu-west-1]
module.tfstate_backend.data.aws_iam_policy_document.prevent_unencrypted_uploads[0]: Reading...
module.tfstate_backend.module.log_storage.data.aws_partition.current: Read complete after 0s [id=aws]
module.tfstate_backend.data.aws_iam_policy_document.prevent_unencrypted_uploads[0]: Read complete after 0s [id=3025385167]
module.tfstate_backend.aws_s3_bucket.default[0]: Refreshing state... [id=elbokade-tf-state-backend]
module.tfstate_backend.module.log_storage.data.aws_caller_identity.current: Read complete after 0s [id=587678272550]
module.tfstate_backend.aws_s3_bucket_public_access_block.default[0]: Refreshing state... [id=elbokade-tf-state-backend]
module.output_parameters.aws_ssm_parameter.default["/elbokade/backend-state/s3_bucket_name"]: Refreshing state... [id=/elbokade/backend-state/s3_bucket_name]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

 # module.output_parameters.aws_ssm_parameter.default["/elbokade/backend-state/s3_bucket_name"] has changed
 ~ resource "aws_ssm_parameter" "default" {
       id        = "/elbokade/backend-state/s3_bucket_name"
       name      = "/elbokade/backend-state/s3_bucket_name"
     + tags      = {}
       # (8 unchanged attributes hidden)
   }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
 + create

Terraform will perform the following actions:

 # module.output_parameters.aws_ssm_parameter.default["/elbokade/backend-state/dynamodb_table_name"] will be created
 + resource "aws_ssm_parameter" "default" {
     + arn            = (known after apply)
     + data_type      = "text"
     + id             = (known after apply)
     + insecure_value = (known after apply)
     + key_id         = (known after apply)
     + name           = "/elbokade/backend-state/dynamodb_table_name"
     + overwrite      = true
     + tags_all       = (known after apply)
     + tier           = "Standard"
     + type           = "String"
     + value          = (sensitive value)
     + version        = (known after apply)
   }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

 with module.tfstate_backend.aws_s3_bucket.default,
 on .terraform/modules/tfstate_backend/main.tf line 156, in resource "aws_s3_bucket" "default":
156: resource "aws_s3_bucket" "default" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 4 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```
 
   </details>